Catalogs/бит_СписокУлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СписокУлиц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтароеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖСБТИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУлицы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыУлицы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУлицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонГород</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АдминистративныеОкруга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СписокУлиц/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

// Процедура проверяет уникальность дома.
//
Процедура ПроверитьУникальностьДома(Отказ)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СписокУлиц.Ссылка
	               |ИЗ
	               |	Справочник.бит_СписокУлиц КАК СписокУлиц
	               |ГДЕ
	               |	СписокУлиц.Наименование = &Наименование
	               |	И СписокУлиц.Ссылка <> &Ссылка
				   |	И СписокУлиц.РайонГород = &РайонГород";

	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("Ссылка"      ,Ссылка);
	Запрос.УстановитьПараметр("РайонГород"  , ЭтотОбъект.РайонГород);
		
	Если Не Запрос.Выполнить().Пустой() тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Введенная улица уже существует",Отказ,,СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьУникальностьУлицы(Отказ)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СписокУлиц.Ссылка КАК Ссылка,
	               |	СписокУлиц.РайонГород КАК РайонГород
	               |ИЗ
	               |	Справочник.бит_СписокУлиц КАК СписокУлиц
	               |ГДЕ
	               |	СписокУлиц.Наименование = &Наименование
	               |	И СписокУлиц.РайонГород = &РайонГород";
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Запрос.УстановитьПараметр("РайонГород"  , ЭтотОбъект.РайонГород);
		
	Если Не Запрос.Выполнить().Пустой() тогда
		возврат;
	//	бит_ОбщегоНазначения.СообщитьОбОшибке("Введенная улица уже существует", Отказ,,СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" объекта справочника. 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;	
	
	// Выполним проверку заполненности обязательных реквизитов для элемента справочника.
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнено наименование!");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Укажем, что надо проверить:
	СтруктураРеквизитов = Новый Структура();
		
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ, "Проверка заполнения обязательных реквизитов элемента справочника ""Список улиц"".");
	
	// Если изменили наименование улицы, сохраним старое наименование в соответствующем реквизите.
	Если НЕ Наименование = Ссылка.Наименование Тогда
		СтароеНаименование = Ссылка.Наименование;
	КонецЕсли;
	
	//12.08.2019
	Если Не Отказ тогда
		ПроверитьУникальностьУлицы(Отказ);
	КонецЕсли;
	
	Если Не Отказ тогда
		ПроверитьУникальностьДома(Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
